[
  {
    "id": 1,
    "is_fauna": true,
    "name": "White-tailed Deer",
    "scientific_name": "Odocoileus virginianus",
    "description": "The White-tailed Deer is a medium-sized, graceful mammal native to North America. Its distinctive characteristic is the white underside of its tail, which is raised when alarmed. They inhabit a range of habitats, from forests to grasslands, and are known for their agile leaps and excellent sense of hearing.",
    "default_picture_name": "images/white_tailed_deer.jpg"
  },
  {
    "id": 2,
    "is_fauna": true,
    "name": "Black Bear",
    "scientific_name": "Odocoileus virginianus",
    "description": "The Black Bear (Ursus americanus) is a medium to large-sized bear species found across North America. Despite its name, its fur can range from black to brown, blonde, or even white. Omnivorous and adaptable, black bears thrive in various habitats, displaying intelligence and a gentle disposition when not threatened.",
    "default_picture_name": "images/black_bear.jpg"
  },
  {
    "id": 3,
    "is_fauna": true,
    "name": "Raccoon",
    "scientific_name": "Procyon lotor",
    "description": "The raccoon (Procyon lotor) is a medium-sized, nocturnal mammal native to North and Central America. Recognized by its distinctive black \"mask\" markings around the eyes and ringed tail, raccoons are omnivorous, using their dexterous paws to forage for food in a wide range of habitats, often displaying clever problem-solving abilities.",
    "default_picture_name": "images/raccoon.jpg"
  },
  {
    "id": 4,
    "is_fauna": true,
    "name": "Red Fox",
    "scientific_name": "Vulpes vulpes",
    "description": "The red fox (Vulpes vulpes) is a small to medium-sized carnivorous mammal widely distributed across North America, Europe, and Asia. Known for its striking red or orange fur, white underbelly, and bushy tail with a white tip, red foxes are highly adaptable hunters, preying on small mammals, birds, and insects.",
    "default_picture_name": "images/red_fox.jpg"
  },
  {
    "id": 5,
    "is_fauna": true,
    "name": "Eastern Gray Squirrel",
    "scientific_name": "Sciurus carolinensis",
    "description": "The Eastern Gray Squirrel (Sciurus carolinensis) is a small to medium-sized rodent native to North America. Easily recognizable by its bushy tail, gray fur, and white underbelly, it is an adept climber and jumper. Often seen in urban and suburban areas, these squirrels have a varied diet and play a crucial role in seed dispersal.",
    "default_picture_name": "images/eastern_gray_squirrel.jpg"
  },
  {
    "id": 6,
    "is_fauna": true,
    "name": "Eastern Chipmunk",
    "scientific_name": "Tamias striatus",
    "description": "\nThe Eastern Chipmunk (Tamias striatus) is a small, striped rodent native to eastern North America. With its distinctive stripes along its back and cheeks, it's easily recognizable. These active creatures are burrow-dwellers and stash food in cheek pouches to store for winter. They consume nuts, seeds, fruits, and insects, contributing to ecosystem diversity.",
    "default_picture_name": "images/eastern_chipmunk.jpg"
  },
  {
    "id": 7,
    "is_fauna": true,
    "name": "Eastern Cottontail Rabbit ",
    "scientific_name": "Sylvilagus floridanus",
    "description": "The Eastern Cottontail Rabbit (Sylvilagus floridanus) is a medium-sized rabbit species native to eastern North America. Its name comes from the fluffy white underside of its short tail, resembling a cotton ball. These nocturnal herbivores have excellent camouflage, relying on speed and agility to escape predators. They play a crucial role in the food chain, providing a food source for various predators.",
    "default_picture_name": "images/eastern_cottontail_rabbit.jpg"
  },
  {
    "id": 8,
    "is_fauna": true,
    "name": "Canada Goose",
    "scientific_name": "Branta canadensis",
    "description": "The Canada Goose (Branta canadensis) is a large waterfowl species native to North America. Recognized by its striking black head, white cheeks, and distinctive \"honking\" call, these migratory birds are known for their V-shaped flight formations during seasonal movements. They inhabit a variety of habitats, including lakes, ponds, and grassy areas, and are often seen grazing on grass and aquatic plants.",
    "default_picture_name": "images/canada_goose.jpg"
  },
  {
    "id": 9,
    "is_fauna": true,
    "name": "Mallard Duck",
    "scientific_name": "Anas platyrhynchos",
    "description": "\nThe Mallard Duck (Anas platyrhynchos) is a medium-sized dabbling duck found throughout North America, Europe, and parts of Asia. The males (drakes) have vibrant green heads, white neck rings, and a rusty chest, while females (hens) are more subdued with mottled brown plumage. They are versatile birds, foraging in water for aquatic plants and insects, and on land for grains and seeds. Mallards are well-adapted to human-altered habitats, making them one of the most common and recognizable ducks worldwide.",
    "default_picture_name": "images/mallard_duck.jpg"
  },
  {
    "id": 10,
    "is_fauna": true,
    "name": "American Robin",
    "scientific_name": "Turdus migratorius",
    "description": "The American Robin (Turdus migratorius) is a medium-sized migratory songbird native to North America. Known for its vibrant orange-red breast, dark head, and grayish back, it's a familiar sight in suburban gardens and parks. These thrushes feed on insects, worms, and berries, often seen hopping and tugging at the ground to find food. They are early harbingers of spring, their cheerful songs signaling the season's arrival.",
    "default_picture_name": "images/american_robin.jpg"
  },
  {
    "id": 11,
    "is_fauna": true,
    "name": "Eastern Bluebird",
    "scientific_name": "Sialia sialis",
    "description": "The Eastern Bluebird (Sialia sialis) is a small and colorful songbird native to eastern North America. The males exhibit vibrant blue plumage on their backs and wings, with a rusty-red breast, while females have more subdued colors. These cavity-nesters are often found perched on wires or branches, foraging for insects and berries. With the help of conservation efforts, their populations have rebounded, delighting many with their melodious songs and stunning appearances.",
    "": "images/eastern_bluebird.jpg"
  },
  {
    "id": 12,
    "is_fauna": true,
    "name": "American Goldfinch",
    "scientific_name": "Spinus tristis",
    "description": "The American Goldfinch (Spinus tristis) is a small, vibrant songbird native to North America. During the breeding season, males display bright yellow plumage with black wings and a black cap, while females are a more muted yellow-green. These acrobatic birds feed on seeds from various plants, and their cheerful melodies fill the air during spring and summer. In winter, their plumage changes to a duller olive color, blending with the surroundings.",
    "default_picture_name": "images/american_goldfinch.jpg"
  },
  {
    "id": 13,
    "is_fauna": true,
    "name": "Red-winged Blackbird",
    "scientific_name": "Agelaius phoeniceus",
    "description": "\nThe Red-winged Blackbird (Agelaius phoeniceus) is a medium-sized songbird native to North and Central America. The males are easily recognized by their glossy black plumage with bright red and yellow shoulder patches, while females are more brown and streaked. These birds thrive in wetland habitats, where they nest and sing from cattails and other marsh vegetation. Red-winged blackbirds are highly social and form large flocks during migration.",
    "default_picture_name": "images/red_winged_blackbird.jpg"
  },
  {
    "id": 14,
    "is_fauna": true,
    "name": "Bald Eagle",
    "scientific_name": "Haliaeetus leucocephalus",
    "description": "\nThe Bald Eagle (Haliaeetus leucocephalus) is a majestic bird of prey and the national symbol of the United States. With its distinctive white head and tail, and dark brown body, it's easily recognizable. These raptors have powerful talons and keen eyesight, enabling them to hunt fish and small mammals near bodies of water. Once endangered, conservation efforts have led to their population recovery, making them a symbol of strength and conservation success.",
    "default_picture_name": "images/bald_eagle.jpg"
  },
  {
    "id": 15,
    "is_fauna": true,
    "name": "Osprey",
    "scientific_name": "Pandion haliaetus",
    "description": "The Osprey (Pandion haliaetus) is a fish-eating bird of prey with a white head, dark eye stripe, and brownish-black wings. Known for its exceptional fishing skills, it dives and catches fish from the water's surface using specialized feet. These migratory birds build large stick nests on elevated platforms near water bodies, making them a fascinating and iconic species worldwide.",
    "default_picture_name": "images/osprey.jpg"
  },
  {
    "id": 16,
    "is_fauna": true,
    "name": "Wild Turkey",
    "scientific_name": "Turdus migratorius",
    "description": "\nThe Wild Turkey (Meleagris gallopavo) is a large bird native to North America. Males, or toms, display distinctive plumage, including iridescent feathers and a fan-like tail. Known for their gobbling calls during mating season, they inhabit forests and grasslands, foraging for seeds, insects, and fruits. Once nearly extinct, conservation efforts have helped restore their populations.",
    "default_picture_name": "images/wild_turkey.jpg"
  },
  {
    "id": 17,
    "is_fauna": true,
    "name": "American Beaver",
    "scientific_name": "Castor canadensis",
    "description": "\nThe American Beaver (Castor canadensis) is a semi-aquatic rodent native to North America. Known for their impressive dam-building skills, they create lodges by constructing dams with sticks and mud. Beavers have webbed feet and a broad, flat tail that aids in swimming. They are herbivores, feasting on bark, leaves, and aquatic plants. Their presence in ecosystems provides benefits such as creating wetland habitats and regulating water flow.",
    "default_picture_name": "images/american_beaver.jpg"
  },
  {
    "id": 18,
    "is_fauna": true,
    "name": "Eastern Coyote ",
    "scientific_name": "Canis latrans",
    "description": "The Eastern Coyote (Canis latrans) is a canine species inhabiting eastern North America. Larger than its western counterparts, it is a highly adaptable predator, feeding on a wide range of prey, including small mammals, birds, and fruits. This clever and elusive carnivore plays an essential role in regulating ecological balance and is known for its distinct yips and howls during the night.",
    "default_picture_name": "images/eastern_coyote.jpg"
  },
  {
    "id": 19,
    "is_fauna": true,
    "name": "Eastern Skunk",
    "scientific_name": "Mephitis mephitis",
    "description": "The Eastern Skunk (Mephitis mephitis) is a small mammal found in eastern North America. Known for its characteristic black fur with white stripes, it's famous for its strong-smelling defensive spray used to deter predators. Skunks are omnivores, feeding on insects, small mammals, fruits, and vegetation. They are primarily nocturnal and play a crucial role in controlling insect populations.",
    "default_picture_name": "images/eastern_skunk.jpg"
  },
  {
    "id": 20,
    "is_fauna": true,
    "name": "Eastern Box Turtle",
    "scientific_name": "Terrapene carolina carolina",
    "description": "The Eastern Box Turtle (Terrapene carolina) is a small to medium-sized turtle species native to eastern North America. Recognized by their high-domed carapace (shell) and hinged plastron (bottom shell), they can close themselves tightly for protection. These omnivorous turtles are terrestrial, living in woodlands and grasslands, and are known for their slow and steady movements. Unfortunately, they face threats from habitat loss and road mortality, making conservation efforts crucial for their survival.",
    "default_picture_name": "images/eastern_box_turtle.jpg"
  },
  {
    "id": 21,
    "is_fauna": true,
    "name": "Painted Turtle",
    "scientific_name": "Chrysemys picta",
    "description": "The Painted Turtle (Chrysemys picta) is a colorful turtle species native to North America. It is named for its striking yellow and red markings on its head, neck, and legs, resembling paint strokes. These small to medium-sized turtles are found in freshwater habitats such as ponds, lakes, and slow-moving rivers. Painted turtles are omnivorous, feeding on aquatic plants, insects, and small aquatic animals. They are excellent swimmers and baskers, often seen sunning themselves on logs or rocks.",
    "default_picture_name": "images/painted_turtle.jpg"
  },
  {
    "id": 22,
    "is_fauna": true,
    "name": "Snapping Turtle",
    "scientific_name": "Chelydra serpentina",
    "description": "\nThe Snapping Turtle (Chelydra serpentina) is a large freshwater turtle found in North America. Known for its powerful jaws and aggressive behavior, it can deliver a painful bite when threatened. With a dark, ridged shell and a long tail, it is well-adapted to aquatic life. These omnivorous turtles feed on fish, insects, plants, and small animals, making them formidable predators in their wetland habitats.",
    "default_picture_name": "images/snapping_turtle.jpg"
  },
  {
    "id": 23,
    "is_fauna": true,
    "name": "Northern Leopard Frog",
    "scientific_name": "Lithobates pipiens",
    "description": "\nThe Northern Leopard Frog (Lithobates pipiens) is a medium-sized frog native to North America. Its name comes from the distinctive leopard-like spots on its green or brownish skin. These amphibians inhabit a variety of wetland habitats, including ponds, marshes, and slow-moving streams. Known for their distinctive call during breeding season, they play a vital role in controlling insect populations and are important indicators of wetland health.",
    "default_picture_name": "images/northern_leopard_frog.jpg"
  },
  {
    "id": 24,
    "is_fauna": true,
    "name": "Common Garter Snake",
    "scientific_name": "Thamnophis sirtalis",
    "description": "\nThe Common Garter Snake (Thamnophis sirtalis) is a non-venomous snake found throughout North America. With a long, slender body and distinct stripes running along its length, it is easily recognizable. These snakes are adaptable and can be found in a variety of habitats, including grasslands, forests, and wetlands. Garter snakes primarily feed on small prey such as insects, amphibians, and small rodents, making them valuable in controlling pest populations.",
    "default_picture_name": "images/common_garter_snake.jpg"
  },
  {
    "id": 25,
    "is_fauna": true,
    "name": "Eastern Milk Snake",
    "scientific_name": "Turdus migratorius",
    "description": "The Eastern Milk Snake (Lampropeltis triangulum) is a non-venomous snake native to eastern North America. It has a distinctive pattern of reddish-brown or grayish-brown bands bordered by black on a light-colored background, resembling the colors of milk spilled on the ground. These secretive and nocturnal snakes are excellent climbers and feed on small rodents, birds, and eggs. They play a crucial role in maintaining ecological balance by controlling rodent populations.",
    "default_picture_name": "images/eastern_milk_snake.jpg"
  },
  {
    "id": 26,
    "is_fauna": true,
    "name": "Monarch Butterfly ",
    "scientific_name": "Danaus plexippus",
    "description": "\nThe Monarch Butterfly (Danaus plexippus) is a well-known butterfly species found in North America. With its striking orange wings adorned with black veins and white spots, it is easily recognizable. These migratory insects undertake an incredible journey, traveling thousands of miles from Canada and the United States to Mexico during their annual migration. Monarch butterflies are known for their remarkable life cycle, which includes a unique multigenerational migration phenomenon, captivating observers worldwide.",
    "default_picture_name": "images/monarch_butterfly.jpg"
  },
  {
    "id": 27,
    "is_fauna": true,
    "name": "Honey Bee",
    "scientific_name": "Apis mellifera",
    "description": "The Honey Bee (Apis mellifera) is a small, highly social insect known for its vital role in pollination and honey production. Living in colonies with a queen, worker bees, and drones, they communicate through intricate dances to communicate the location of food sources. Honey bees collect nectar from flowers and transform it into honey, an essential food source for the colony during winter. Their pollination services are crucial for the reproduction of many plants, contributing to biodiversity and food production worldwide.",
    "default_picture_name": "images/honey_bee.jpg"
  },
  {
    "id": 28,
    "is_fauna": true,
    "name": "Bumblebee",
    "scientific_name": "Bombus terrestris",
    "description": "Bombus terrestris, commonly known as the Buff-tailed Bumblebee, is a species of bumblebee found in Europe and parts of Asia. Recognized by its yellow and black body, the queen and workers have a white \"buff\" color at the end of their abdomen. These important pollinators visit a wide variety of plants and contribute to ecosystem health. Buff-tailed bumblebees are social insects that establish colonies and play a crucial role in supporting biodiversity and agricultural productivity.",
    "default_picture_name": "images/bumblebee.jpg"
  },
  {
    "id": 29,
    "is_fauna": true,
    "name": "Eastern Newt",
    "scientific_name": "Turdus migratorius",
    "description": "The Eastern Newt (Notophthalmus viridescens) is a small salamander native to eastern North America. It has a unique life cycle, starting as an aquatic larva (eft) with bright orange coloration, then transitioning into a terrestrial juvenile with greenish-brown skin, and finally becoming an aquatic adult with olive-brown or yellow markings. Eastern newts inhabit freshwater ponds, lakes, and streams and are essential components of the aquatic ecosystems, serving as both predator and prey.",
    "default_picture_name": "images/eastern_newt.jpg"
  },
  {
    "id": 30,
    "is_fauna": true,
    "name": "Northern Red Salamander",
    "scientific_name": "Pseudotriton ruber",
    "description": "The Northern Red Salamander (Pseudotriton ruber) is a small, brightly colored salamander native to eastern North America. Known for its vibrant red or orange skin with black spots, it is easily recognizable. These amphibians inhabit cool, moist environments, such as forests and near streams, where they hide under logs and leaf litter. They are carnivorous, feeding on insects, small invertebrates, and even other small salamanders. Northern Red Salamanders are important indicators of ecosystem health and play a vital role in maintaining ecological balance.",
    "default_picture_name": "images/northern_red_salamander.jpg"
  },
  {
    "id": 31,
    "is_fauna": true,
    "name": "Common Loon",
    "scientific_name": "Gavia immer",
    "description": "The Common Loon (Gavia immer) is a large, striking waterbird native to North America. Known for its haunting, eerie calls, it's often found on freshwater lakes and ponds. These expert divers have a sleek black head and neck, white belly, and striking red eyes. Common Loons feed on fish and crustaceans, using their powerful webbed feet to propel themselves underwater. With their unique calls and graceful movements, they are beloved symbols of wilderness and conservation.",
    "default_picture_name": "images/common_loon.jpg"
  },
  {
    "id": 32,
    "is_fauna": true,
    "name": "Double-crested Cormorant ",
    "scientific_name": "Phalacrocorax auritus",
    "description": "The Double-crested Cormorant (Phalacrocorax auritus) is a medium to large waterbird found across North America. It has a sleek black body, long neck, and a distinctive double crest of feathers on its head during the breeding season. Known for its excellent diving and swimming abilities, it feeds on fish, diving underwater to catch its prey. Often seen perched with wings outstretched to dry, this social bird is a common sight near lakes, rivers, and coastlines.",
    "default_picture_name": "images/double_crested_cormorant.jpg"
  },
  {
    "id": 33,
    "is_fauna": true,
    "name": "Great Blue Heron",
    "scientific_name": "Ardea herodias",
    "description": "The Great Blue Heron (Ardea herodias) is a majestic wading bird found throughout North America. It stands tall with a blue-gray plumage, a long neck, and a sharp, pointed beak for catching fish and other aquatic prey. This solitary and patient hunter can be seen wading in shallow waters, marshes, and wetlands, waiting for the perfect moment to strike. Its grace and beauty make it a captivating sight in its natural habitat.",
    "default_picture_name": "images/great_blue_heron.jpg"
  },
  {
    "id": 34,
    "is_fauna": true,
    "name": "Ring-billed Gull",
    "scientific_name": "Larus delawarensis",
    "description": "The Ring-billed Gull (Larus delawarensis) is a medium-sized gull commonly found in North America. It has a white body, gray wings, and a distinctive black ring around its yellow bill. These opportunistic birds thrive in various habitats, from lakes and rivers to coastal areas. Ring-billed gulls are omnivorous, feeding on fish, insects, and scavenging for food scraps near human settlements. They are agile flyers and highly adaptable, often seen in large flocks throughout the year.",
    "default_picture_name": "images/ring_billed_gull.jpg"
  },
  {
    "id": 35,
    "is_fauna": true,
    "name": "Belted Kingfisher",
    "scientific_name": "Megaceryle alcyon",
    "description": "The Belted Kingfisher (Megaceryle alcyon) is a medium-sized bird native to North America. With its bluish-gray plumage, prominent crested head, and a distinct white collar or \"belt,\" it's easily recognizable. Kingfishers are skilled hunters that dive headfirst into water to catch fish and aquatic prey. They inhabit rivers, lakes, and coastal areas, where their rattling calls and aerial displays add a touch of wild beauty to the landscape.",
    "default_picture_name": "images/belted_kingfisher.jpg"
  },
  {
    "id": 36,
    "is_fauna": true,
    "name": "American Crow",
    "scientific_name": "Corvus brachyrhynchos",
    "description": "The American Crow (Corvus brachyrhynchos) is a large, intelligent, and adaptable bird native to North America. With its glossy black plumage and sturdy beak, it is easily recognizable. Crows are highly social and can be found in a variety of habitats, from urban areas to forests. They are omnivorous, feeding on a diverse diet that includes fruits, insects, small animals, and carrion. Known for their vocal calls and clever problem-solving abilities, crows are an iconic and ubiquitous part of the North American landscape.",
    "default_picture_name": "images/american_crow.jpg"
  },
  {
    "id": 37,
    "is_fauna": true,
    "name": "Blue Jay",
    "scientific_name": "Cyanocitta cristata",
    "description": "\nThe Blue Jay (Cyanocitta cristata) is a colorful and striking bird found in eastern North America. With its vibrant blue feathers, white chest, and distinctive crest, it stands out in any setting. Blue jays are intelligent and social birds, known for their vocal calls and mimicry skills. They are omnivorous, feeding on nuts, seeds, insects, and sometimes small vertebrates. Blue jays are also important seed dispersers, contributing to forest regeneration.",
    "default_picture_name": "images/blue_jay.jpg"
  },
  {
    "id": 38,
    "is_fauna": true,
    "name": "White-breasted Nuthatch",
    "scientific_name": "Sitta carolinensis",
    "description": "\nThe White-breasted Nuthatch (Sitta carolinensis) is a small, energetic bird native to North America. With a blue-gray back, white face, and underparts, it has a distinct black cap and a short, stubby tail. Nuthatches are agile climbers, often seen walking headfirst down trees in search of insects and seeds. Their nasal \"yank-yank\" calls add a cheerful sound to woodlands and gardens.",
    "default_picture_name": "images/white_breasted_nuthatch.jpg"
  },
  {
    "id": 39,
    "is_fauna": true,
    "name": "Black-capped Chickadee",
    "scientific_name": "Turdus migratorius",
    "description": "\nThe Black-capped Chickadee (Poecile atricapillus) is a small, charismatic bird native to North America. Recognized by its black cap and bib, white cheeks, and grayish back, it's a familiar sight in woodlands and backyards. Chickadees are social, forming flocks during the colder months. They have a cheerful, distinctive \"chick-a-dee-dee-dee\" call and feed on seeds, insects, and berries. Known for their acrobatic skills, they are a delightful addition to any birdwatching experience.",
    "default_picture_name": "images/black_capped_chickadee.jpg"
  },
  {
    "id": 40,
    "is_fauna": true,
    "name": "American Woodcock",
    "scientific_name": "Turdus migratorius",
    "description": "\nThe American Woodcock (Scolopax minor) is a unique and elusive bird found in eastern North America. With its plump body, long bill, and large eyes positioned high on its head, it has adapted to feeding on insects in soft soil. Woodcocks are known for their mesmerizing courtship display, performing aerial spirals and making unique \"peent\" calls. These birds are most active at dusk and dawn, adding a touch of magic to springtime wetlands and forests.",
    "default_picture_name": "images/american_woodcock.jpg"
  },
  {
    "id": 41,
    "is_fauna": true,
    "name": "Northern Cardinal",
    "scientific_name": "Cardinalis cardinalis",
    "description": "The Northern Cardinal (Cardinalis cardinalis) is a striking and well-known songbird found in North America. With its bright red plumage and distinctive crest, the male is easily identifiable. Cardinals are also present in a more subtle brownish coloration. They are frequent visitors to bird feeders, often singing their melodious tunes from treetops and shrubs. Cardinals are monogamous and maintain territories year-round, bringing color and beauty to gardens and parks.",
    "default_picture_name": "images/northern_cardinal.jpg"
  },
  {
    "id": 42,
    "is_fauna": true,
    "name": "Song Sparrow",
    "scientific_name": "Melospiza melodia",
    "description": "\nThe Song Sparrow (Melospiza melodia) is a small and common bird native to North America. With its streaked brown back and wings, white belly, and a central spot on its chest, it's recognizable in many habitats. Song sparrows are known for their delightful and varied songs, which vary by region. They forage on the ground for seeds, insects, and fruits, and their sweet melodies add charm to gardens and grasslands.",
    "default_picture_name": "images/song_sparrow.jpg"
  },
  {
    "id": 43,
    "is_fauna": true,
    "name": "Chipping Sparrow",
    "scientific_name": "Spizella passerina",
    "description": "\nThe Chipping Sparrow (Spizella passerina) is a small, slender bird native to North America. With a crisp, brownish-gray cap, a rufous crown, and a white eyebrow stripe, it has a distinct appearance. Chipping sparrows are common in open woodlands, gardens, and parks. They feed on seeds, insects, and berries and are known for their cheerful, repetitive song that resembles a dry, rapid \"chip-chip-chip.\"",
    "default_picture_name": "images/chipping_sparrow.jpg"
  },
  {
    "id": 44,
    "is_fauna": true,
    "name": "White-throated Sparrow",
    "scientific_name": "Turdus migratorius",
    "description": "\nThe White-throated Sparrow (Zonotrichia albicollis) is a medium-sized bird native to North America. With its striking black and white head stripes, yellow patches above the eyes, and a white throat, it's easily identifiable. White-throated sparrows are commonly found in forests and shrubby areas. They forage for seeds, insects, and fruits on the ground, and their distinctive and melodious song adds a beautiful, whistling element to their woodland habitats.",
    "default_picture_name": "images/white_throated_sparrow.jpg"
  },
  {
    "id": 45,
    "is_fauna": true,
    "name": "American Toad",
    "scientific_name": "Turdus migratorius",
    "description": "The American Toad (Anaxyrus americanus) is a medium-sized, terrestrial toad native to North America. It has dry, warty skin and can be various shades of brown, gray, or olive with lighter spots. These toads are commonly found in woodlands, gardens, and near water sources. They are nocturnal and feed on insects and other small invertebrates. During breeding season, their high-pitched trill can be heard in wetland areas, contributing to the chorus of springtime sounds.",
    "default_picture_name": "images/american_toad.jpg"
  },
  {
    "id": 46,
    "is_fauna": true,
    "name": "Gray Treefrog",
    "scientific_name": "Hyla versicolor",
    "description": "The Gray Treefrog (Hyla versicolor) is a small, arboreal frog native to eastern North America. With the ability to change its color from gray to green depending on its surroundings, it has remarkable camouflage. These nocturnal frogs are excellent climbers and can be found in trees, shrubs, and vegetation near water sources. They have a distinctive trilling call, adding a delightful chorus to warm summer evenings.",
    "default_picture_name": "images/gray_treefrog.jpg"
  },
  {
    "id": 47,
    "is_fauna": true,
    "name": "Eastern Red-backed Salamander",
    "scientific_name": "Plethodon cinereus",
    "description": "The Eastern Red-backed Salamander (Plethodon cinereus) is a small terrestrial salamander native to eastern North America. With its shiny black body and a striking red stripe running down its back, it's easily identifiable. These salamanders prefer moist, cool habitats, such as forests and under rocks or logs. They are active year-round, foraging on insects and small invertebrates. Eastern Red-backed Salamanders are important members of forest ecosystems, contributing to nutrient cycling and soil health.",
    "default_picture_name": "images/eastern_red_backed_salamander.jpg"
  },
  {
    "id": 48,
    "is_fauna": true,
    "name": "Eastern Red Squirrel",
    "scientific_name": "Tamiasciurus hudsonicus",
    "description": "The Eastern Red Squirrel (Tamiasciurus hudsonicus) is a small tree-dwelling mammal native to eastern North America. With a vibrant reddish-brown fur coat and a white belly, it's easily recognized. These active squirrels are highly agile and skilled climbers, foraging for nuts, seeds, and fruits in trees. They are known for their high-pitched chattering and are an essential part of forest ecosystems, helping to disperse seeds and maintain tree populations.",
    "default_picture_name": "images/eastern_red_squirrel.jpg"
  },
  {
    "id": 49,
    "is_fauna": true,
    "name": "American Mink",
    "scientific_name": "Neovison vison",
    "description": "\nThe American Mink (Neovison vison) is a small, semi-aquatic mammal native to North America. It has a sleek, dark brown fur coat and a white patch on its chin. Minks are proficient swimmers and can be found near rivers, streams, and coastal areas. They are skilled predators, feeding on fish, amphibians, birds, and small mammals. Minks play an important role in controlling aquatic and rodent populations in their habitats.",
    "default_picture_name": "images/american_mink.jpg"
  },
  {
    "id": 50,
    "is_fauna": true,
    "name": "Painted Lady Butterfly",
    "scientific_name": "Vanessa cardui",
    "description": "The Painted Lady Butterfly (Vanessa cardui) is a colorful and widespread butterfly species found across North America, Europe, and Asia. It has orange and black wings with distinct black and white markings. Painted ladies are migratory insects, traveling long distances during seasonal movements. They feed on nectar from a wide variety of flowers, making them valuable pollinators. These beautiful butterflies are a joy to observe in gardens and meadows during their annual migrations.",
    "default_picture_name": "images/skunk.jpg"
  }
]